<?php
// Start session
session_start();
// If the user is not logged in redirect to the login page
if (!isset($_SESSION['loggedin'])) {
    header('Location: login.php');
    exit;
}
?>

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Αρχική Σελίδα</title>
    <link rel="stylesheet" href="css/style.css">
</head>

<body>
    <div class="page_container">

        <?php include('header_menu.php') ?>

        <div class="main_content_block">
            <div id="homepage_container">
                <p>Καλωσορίσατε! Ο ιστοχώρος αυτός δημιουργήθηκε με σκοπό την εκμάθηση html και php στα πλαίσια του
                    μαθήματος "Εκπαιδευτικά Περιβάλλονα Δαδικτύου".
                    Στόχος του ιστοχώρου αυτού είναι η υλοποίηση μίας απλής πλτφόρμας που θα υποστηρίζει ένα προπτυχιακό
                    μάθημα επιτρέποντας στους διδάσκοντες να ανεβάζουν υλικό
                    όπως ανακοινώσεις εργασίες και παράλληλα θα δίνει πρόσβαση στους μαθητές στο περιεχόμενο του
                    μαθήματος και θα καθιστά την επικοινωνί με τους διδάσκοντες εφικτή.
                </p>
            </div>
            <ul id="home_page_list">
                <li>
                    <h3>Αρχική Σελίδα</h3>
                    <p>Η Αρχική σελίδα είναι η παρούσα σελίδα και περιλαμβάνει μια σύντομη παρουσίαση του ιστοχώρου και
                        των λειτουργιών του.</p>

                </li>
                <li>
                    <h3>Ανακοινώσεις</h3>
                    <p>Η σελίδα αυτή περιλαμβάνει μία λίστα απο ανακοινώσεις σχετικά με το μάθημα οι αποίες αναρτούνται
                        απο τους διδάστοντες (tutors) και διαβάζονται απο τους μαθητές (students)</p>
                </li>
                <li>
                    <h3>Επικοινωνία</h3>
                    <p>Η σελίδα αυτή δίνει τη δυνατότητα στους φοιτητές που είναι εγκεγραμμένοι στη πλατφόρμα να
                        επικοινωνήσουν με τους διδάσκοντες του
                        μαθήματος είτε μέσω μίας φόρμας η οποία αποστέλετε ώς email κατά την υποβολή είτε επιτρέπει την
                        απευθείας αποστολή εμαιλ μέσου κάποιου email client.</p>
                </li>
                <li>
                    <h3>Έγγραφα Μαθήματος</h3>
                    <p>Η σελίδα αυτή περιλαμβάνει μία λίστα στην οποία οι διδάσκοντε (οι χρήστες που έχουν το ρόλο του
                        tutor) έχουν τη δινατότητα
                        να ανεβάζουν αρχεία όπως σημειώσεις διαφάνειες κλπ τις οποίες στη συνέχεια οι φοιτητές (οι
                        χρήστες με το ρόλο student) θα μπρούν να κατεβάζουν.</p>
                </li>
                <li>
                    <h3>Εργασίες</h3>
                    <p>Η σελίδα αυτή περιλαμβάνει μια λίστα με τις εργασίες του μαθήματος που αναρτώνται απο τους
                        διδάσκοντες και δίνει πρόσβαση στους μαθητές στο περιεχόμενό τους και σε σχετικές πληροφορίες.
                    </p>
                </li>
            </ul>
        </div>
    </div>
</body>

</html>